# Pandas Transform 실전 연습 문제

### 0. 데이터 불러오기

In [1]:
import pandas as pd
import numpy as np

In [5]:
#read_csv()

In [8]:
df = pd.read_csv('Salaries.csv')
df.head()

/opt/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [6]:
#head()

In [9]:
#tail()
df.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148640,148641,Charlene D Mccully,Parking Control Officer,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148641,148642,Raphael Marquis Goins,Museum Guard,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148642,148643,Dominic C Marquez,Sign Worker,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148643,148644,Kim Brewer,Parking Control Officer,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT

In [10]:
#info() 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148645 entries, 0 to 148644
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148645 non-null  int64
 1   EmployeeName      148645 non-null  object
 2   JobTitle          148645 non-null  object
 3   BasePay           148040 non-null  float64
 4   OvertimePay       148645 non-null  float64
 5   OtherPay          148645 non-null  float64
 6   Benefits          112486 non-null  float64
 7   TotalPay          148645 non-null  float64
 8   TotalPayBenefits  148645 non-null  float64
 9   Year              148645 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148645 non-null  object
 12  Status            38114 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

### 1. 평균 basepay는 얼마인가요?

In [11]:
#mean()
df['BasePay'].mean()

66327.6889596918

### 2. 최대 OvertimePay는 얼마인가요?

In [17]:
df['OvertimePay'] > 30000

0         False
1          True
2          True
3          True
4         False
          ...
148640    False
148641    False
148642    False
148643    False
148644    False
Name: OvertimePay, Length: 148645, dtype: bool

In [18]:
#max()
df['OvertimePay'].max()

245131.88

### 3. JOSEPH DRISCOLL의 job title은 무엇인가요?

In [20]:
#[]
df[df['EmployeeName'] == 'JOSEPH DRISCOLL'][JobTitle]

NameError: name 'JobTitle' is not defined

### 4. JOSEPH DRISCOLL의 급여는 얼마인가요? (benefits 포함해서)

In [21]:
#
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

### 5. 월급(Benefit포함) 이 가장 높은 사람은 누구인가요?

In [23]:
#
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

### 6. 월급(Benefit포함) 이 가장 낮은 사람은 누구인가요?

In [25]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
110530,110531,David P Kucia,Police Officer 3,NaN,0.0,0.0,-33.89,0.0,-33.89,2013,NaN,San Francisco,NaN

### 7. 2011~2014년 동안의 BasePay의 평균은 얼마 인가요?

In [27]:
df.groupby('Year').mean()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Notes
Year,,,,,,,,
2011,18080.0,63595.956517,4531.065429,3617.081926,NaN,71744.103871,71744.103871,NaN
2012,54542.5,65436.406857,5023.417824,3653.437583,26439.966967,74113.262265,100553.229232,NaN
2013,91728.5,69630.030216,5281.641980,3819.969007,23829.076572,77611.443142,101440.519714,NaN
2014,129588.5,66573.154204,5402.702400,3505.897329,24792.853790,75481.753933,100274.607722,NaN

In [26]:
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66573.154204
Name: BasePay, dtype: float64

### 8. JobTitle의 종류는 몇개 인가요?

In [28]:
#unique()
df['JobTitle'].nunique()

2158

### 9. JobTitle중 가장 많은 상위 5개의 JobTitle은 무엇인가요?

In [29]:
#value_counts()
df['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [30]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes
count,148645.000000,148040.000000,148645.000000,148645.00000,112486.000000,148645.000000,148645.000000,148645.000000,0.0
mean,74323.000000,66327.688960,5066.230294,3648.89419,25009.004751,74772.853123,93698.231767,2012.522554,NaN
std,42910.259719,42763.620451,11454.535520,8056.70753,15401.655689,50515.178054,62791.195806,1.117512,NaN
min,1.000000,-166.010000,-0.010000,-7058.59000,-33.890000,0.000000,-33.890000,2011.000000,NaN
25%,37162.000000,33590.347500,0.000000,0.00000,11540.527500,36173.240000,44083.120000,2012.000000,NaN
50%,74323.000000,65008.860000,0.000000,811.35000,28628.875000,71427.790000,92406.390000,2013.000000,NaN
75%,111484.000000,94691.050000,4658.480000,4236.74000,35566.957500,105846.060000,132880.270000,2014.000000,NaN
max,148645.000000,319275.010000,245131.880000,400184.25000,96570.660000,567595.430000,567595.430000,2014.000000,NaN

In [19]:
birth = ['880203','900211','991103','890713','980811']

In [20]:
result = []
for i in birth:
    k = int(i)
    result.append(k)
result

[880203, 900211, 991103, 890713, 980811]

In [21]:
sorted(result)

[880203, 890713, 900211, 980811, 991103]